#include<stdio.h>
#include<stdlib.h>
int main() {
	int i,inputpassword,ch,b=0;
    printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@@@@@@@@@@@@@@@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó @@@@@@@@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@@@@@@@¡ó ¡ó ¡ó ¡ó @@¡ó \n");
	printf("¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó\n");
	printf("¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó\n");
	printf("¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó @@@@¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó @@@@¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó \n");
	printf("¡ó @@¡ó ¡ó ¡ó @@¡ó @@@@@@@@@@¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó @@@@@@@@@@¡ó @@¡ó ¡ó ¡ó @@¡ó\n");
	printf("¡ó @@¡ó ¡ó @@¡ó @@@@@@@@@@@@@@¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó @@@@@@@@@@@@@@¡ó @@¡ó ¡ó @@¡ó\n");
	printf("¡ó @@¡ó ¡ó @@¡ó @@@@@@    @@@@¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó @@@@    @@@@@@¡ó @@¡ó ¡ó @@¡ó\n");
	printf("¡ó @@¡ó ¡ó @@¡ó @@@@@@    @@@@¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó @@@@    @@@@@@¡ó @@¡ó ¡ó @@¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó @@¡ó @@@@@@@@@@¡ó @@¡ó ¡ó @@@@¡ó ¡ó @@¡ó @@@@@@@@@@¡ó @@¡ó ¡ó @@¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó @@@@@@¡ó @@¡ó ¡ó @@@@¡ó ¡ó @@¡ó @@@@@@¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó @@@@@@@@¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó @@@@@@@@¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó @@@@@@¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó @@@@@@¡ó ¡ó ¡ó @@¡ó ¡ó\n"); 
    printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó @@¡ó @@@@@@@@@@@@@@@@@@@@¡ó @@¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó @@¡ó ¡ó ¡ó @@¡ó ¡ó @@¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó @@¡ó ¡ó ¡ó @@¡ó ¡ó @@¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@¡ó ¡ó ¡ó @@¡ó ¡ó @@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@@@@@@@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@@@@@@@@@@@@@@@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
}
