#include<stdio.h>
#include<stdlib.h>
int main() {
	int i,inputpassword,ch,b=0,num;
    printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@@@@@@@@@@@@@@@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó @@@@@@@@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@@@@@@@¡ó ¡ó ¡ó ¡ó @@¡ó \n");
	printf("¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó\n");
	printf("¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó\n");
	printf("¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó @@@@¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó @@@@¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó \n");
	printf("¡ó @@¡ó ¡ó ¡ó @@¡ó @@@@@@@@@@¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó @@@@@@@@@@¡ó @@¡ó ¡ó ¡ó @@¡ó\n");
	printf("¡ó @@¡ó ¡ó @@¡ó @@@@@@@@@@@@@@¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó @@@@@@@@@@@@@@¡ó @@¡ó ¡ó @@¡ó\n");
	printf("¡ó @@¡ó ¡ó @@¡ó @@@@@@    @@@@¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó @@@@    @@@@@@¡ó @@¡ó ¡ó @@¡ó\n");
	printf("¡ó @@¡ó ¡ó @@¡ó @@@@@@    @@@@¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó @@@@    @@@@@@¡ó @@¡ó ¡ó @@¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó @@¡ó @@@@@@@@@@¡ó @@¡ó ¡ó @@@@¡ó ¡ó @@¡ó @@@@@@@@@@¡ó @@¡ó ¡ó @@¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó @@@@@@¡ó @@¡ó ¡ó @@@@¡ó ¡ó @@¡ó @@@@@@¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó @@@@@@@@¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó @@@@@@@@¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó\n");
	printf("¡ó ¡ó @@¡ó ¡ó ¡ó @@@@@@¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó @@@@@@¡ó ¡ó ¡ó @@¡ó ¡ó\n"); 
    printf("¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó @@¡ó @@@@@@@@@@@@@@@@@@@@¡ó @@¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó @@¡ó ¡ó ¡ó @@¡ó ¡ó @@¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó @@¡ó ¡ó ¡ó @@¡ó ¡ó @@¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@¡ó ¡ó ¡ó @@¡ó ¡ó @@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@@@@@@@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@¡ó ¡ó ¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó @@@@@@@@@@@@@@@@@@@@@@@@¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
    printf("¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó ¡ó\n");
    printf("Please enter the password: \n");
	printf("hint: 2025\n");
	do{
		scanf("%d",&inputpassword);
		fflush(stdin);
		if(inputpassword==2025){
			printf("welcome!");
			break;
		}
		if(b>=2){
			printf("Entered incorrectly three times ");
			return 0;
		}
		else b++; 
		printf("Please enter the password: \n");
	}while(inputpassword!=2025);
	system("pause");
 	system("cls");
 	printf("----------[Booking System]----------\n");
        printf("| a. Available seats              |\n");
        printf("| b. Arrange for you              |\n");
        printf("| c. Choose by yourself           |\n");
        printf("| d. Exit                         |\n");
        printf("------------------------------------\n");
        printf("Options on the input form : ");
        scanf(" %c", &num);
}
